{
  "backend/main.mo": "Primary backend actor defining data types, state maps, authorization mixin, and service, profile, order, cart, and notification operations with ID counters.",
  "backend/migration.mo": "Migration module converting old customer orders into expanded orders and initializing notification storage and counters.",
  "feature_evidence.json": "Feature evidence report listing required frontend file changes, associated components, and test IDs for recent feature updates.",
  "frontend-file-summaries.txt": "Text file containing high‑level summaries of multiple frontend components, hooks, pages, and configuration files.",
  "frontend/index.css": "Global Tailwind-based CSS defining OKLCH color tokens, dark mode variables, and base styling for the app.",
  "frontend/index.html": "HTML entry point mounting the React app and loading the Tidio chat script.",
  "frontend/src/App.tsx": "Main React router setup with themed layout and routes for all pages including protected dashboard.",
  "frontend/src/components/AuthGate.tsx": "Authentication guard component that checks Internet Identity state and redirects unauthenticated users to login.",
  "frontend/src/components/BrandFooter.tsx": "Renders a footer with branding, navigation links, contact info, and a dynamic year plus referral link.",
  "frontend/src/components/BrandHeader.tsx": "Implements a responsive header with navigation, login/logout handling, and mobile menu support.",
  "frontend/src/components/BrandLayout.tsx": "Wraps pages with a header, footer, and main content area.",
  "frontend/src/components/OtpDemoField.tsx": "Provides a demo OTP generator and verification UI with state handling.",
  "frontend/src/components/ServiceCard.tsx": "Displays a service card with icon, name, price range, delivery time, and optional action content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries on change.",
  "frontend/src/hooks/useAddToCart.ts": "Offers mutations for adding items to cart and querying caller orders using the backend actor.",
  "frontend/src/hooks/useAuthState.ts": "Exposes authentication state, principal, and initialization status from Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login/clear functions, and identity lifecycle management.",
  "frontend/src/hooks/useServices.ts": "Fetches available services from the backend using the current actor.",
  "frontend/src/hooks/useSupport.ts": "Handles submitting and retrieving support requests through backend actor queries and mutations.",
  "frontend/src/hooks/useUserProfile.ts": "Fetches and saves the caller’s user profile via backend actor interactions.",
  "frontend/src/index.css": "Defines Tailwind base/theme styles with a light and dark premium gold theme and custom utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider wrapping the App component.",
  "frontend/src/pages/ContactPage.tsx": "Renders a styled contact page with email and WhatsApp links and hover effects.",
  "frontend/src/pages/DashboardPage.tsx": "Displays services, support requests, orders, and a prefilled order form with validation and add‑to‑cart logic.",
  "frontend/src/pages/HomePage.tsx": "Shows a marketing homepage with hero, service listings, and calls to action based on auth state.",
  "frontend/src/pages/LoginPage.tsx": "Provides Internet Identity login flow with error handling and redirects authenticated users to the dashboard.",
  "frontend/src/pages/PricingPage.tsx": "Lists service pricing and icons and includes a payment options section with Stripe and PayPal.",
  "frontend/src/pages/ServicesPage.tsx": "Fetches services and renders cards with an Order Now action redirecting based on authentication.",
  "frontend/src/pages/SignUpPage.tsx": "Handles Internet Identity signup, profile completion with validation, OTP check, and profile saving.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params (including hash routing), persist them in sessionStorage, and clear them from the URL hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and plugins for a luxury-styled theme.",
  "project_state.json": "Stores project metadata, architectural notes, and feature definitions for the Elvra Worldwide site."
}