{
  "backend/main.mo": "Defines the main actor with all service, order, profile, payment, and Stripe-related types and initializes maps and state variables for backend data storage.",
  "backend/migration.mo": "Provides migration logic converting old actor state to the new format by adding a stripeConfiguration field initialized to null.",
  "feature_evidence.json": "Lists feature evidence items linking features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten short summaries of numerous frontend files for reference or documentation.",
  "frontend/index.css": "Defines global Tailwind CSS variables for light/dark themes and applies base styling tokens.",
  "frontend/index.html": "HTML entry point mounting the root React app and loading the main script and Tidio chat widget.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, providers, and layout for all pages including product, payment, and order routes.",
  "frontend/src/components/AuthGate.tsx": "Protects routes by redirecting unauthenticated users to login and showing a loading state during identity initialization.",
  "frontend/src/components/BrandFooter.tsx": "Renders the site footer with branding, navigation links, contact info, and a dynamic caffeine.ai referral link.",
  "frontend/src/components/BrandHeader.tsx": "Provides the sticky site header with navigation, authentication controls, and mobile menu handling.",
  "frontend/src/components/BrandLayout.tsx": "Wraps pages with the brand header and footer, providing a consistent layout structure.",
  "frontend/src/components/OtpDemoField.tsx": "Implements a demo OTP generator and verifier with input slots and validation messaging.",
  "frontend/src/components/ProductAddToCartSection.tsx": "Handles sample selection, form validation, and order creation flow for adding a product to cart.",
  "frontend/src/components/ProductOrderFormFields.tsx": "Renders brand name and description fields with word counting for product order forms.",
  "frontend/src/components/ProductSampleSelector.tsx": "Displays selectable sample images with highlighting for the chosen option.",
  "frontend/src/components/ServiceCard.tsx": "Shows a service’s icon, name, price, delivery time, and optional action element.",
  "frontend/src/constants/premiumServices.ts": "Defines fixed premium service metadata and helper functions to retrieve or map service data.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useAddToCart.ts": "Provides mutations for adding items to cart and querying caller orders using the backend actor.",
  "frontend/src/hooks/useAdminOrderVerification.ts": "Hooks for checking admin status, confirming orders after payment, fetching orders by status, and fetching notification requests using an actor and React Query.",
  "frontend/src/hooks/useAuthState.ts": "Derives authentication state from Internet Identity, exposing principal and flags for initialization.",
  "frontend/src/hooks/useConfirmationEmailRequest.ts": "Mutation hook to submit confirmation email requests and invalidate related queries.",
  "frontend/src/hooks/useConfirmationMessageTemplate.ts": "Fetches the confirmation message template from the actor via React Query.",
  "frontend/src/hooks/useCreateCheckoutSession.ts": "Creates a Stripe checkout session through the actor, parsing the returned JSON session.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for creating, loading, and managing Internet Identity authentication.",
  "frontend/src/hooks/useOrderPayment.ts": "Mutation hook to update an order's payment status and refresh caller order data.",
  "frontend/src/hooks/useServices.ts": "Fetches available services from the actor using React Query.",
  "frontend/src/hooks/useStripeConfiguration.ts": "Hooks for checking Stripe configuration status and updating Stripe configuration.",
  "frontend/src/hooks/useStripeVerification.ts": "Hooks for verifying Stripe payment and checking Stripe session status.",
  "frontend/src/hooks/useSupport.ts": "Hooks to submit support requests and fetch support request lists.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks to fetch and save the caller's user profile and basic profile using React Query.",
  "frontend/src/index.css": "Tailwind CSS setup with custom black‑and‑gold theme variables, utilities, and service card styles.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity provider wrappers.",
  "frontend/src/pages/BusinessCardPage.tsx": "Product page displaying business card design details, banner, description, and add‑to‑cart section.",
  "frontend/src/pages/ContactPage.tsx": "Renders a simple contact page with email and WhatsApp links plus hover styling.",
  "frontend/src/pages/DashboardPage.tsx": "Implements the main dashboard with service selection, form handling, cart creation, and admin/payment logic.",
  "frontend/src/pages/HomePage.tsx": "Displays the landing page with hero content, product list, and premium services navigation.",
  "frontend/src/pages/LoginPage.tsx": "Provides Internet Identity login flow and redirects authenticated users to the dashboard.",
  "frontend/src/pages/LogoDesignPage.tsx": "Shows product details for logo design and includes an add‑to‑cart section.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays order confirmation after payment and blocks access unless payment is verified.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows payment cancellation details and offers retry and dashboard navigation options.",
  "frontend/src/pages/PaymentPage.tsx": "Displays order details and initiates Stripe Checkout sessions, handling loading, errors, and redirects.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Verifies Stripe payment status, confirms the order, and redirects to the confirmation page or shows errors.",
  "frontend/src/pages/PhotoFramePage.tsx": "Shows the Photo Frame product details, preview image, and add‑to‑cart section.",
  "frontend/src/pages/PricingPage.tsx": "Lists premium service prices and displays supported payment methods like Stripe and PayPal.",
  "frontend/src/pages/ProductBannerPage.tsx": "Displays product banner previews with toggle controls and includes an add‑to‑cart section.",
  "frontend/src/pages/ServicesPage.tsx": "Lists all premium services with an Order Now flow that redirects based on authentication.",
  "frontend/src/pages/SignUpPage.tsx": "Handles Internet Identity signup and basic profile creation with validation and navigation.",
  "frontend/src/pages/TrackOrderPage.tsx": "React page that fetches caller orders, locates one by ID, and displays its status, payment info, and navigation options with loading and not‑found states.",
  "frontend/src/utils/stripeOrderMapping.ts": "Converts an ExpandedOrder into a Stripe-ready ShoppingItem array by parsing price and building product metadata.",
  "frontend/src/utils/urlParams.ts": "Utilities to read query and hash parameters, including helpers for Stripe session and secret values.",
  "frontend/src/utils/validation.ts": "Word-count and email validation helpers enforcing a 1000-word description limit and basic email format checks.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file describing the restoration of product flow, routing fixes, Stripe payment integration, and known issues."
}