{
  "backend/main.mo": "Defines types and state maps for services, profiles, orders, and notifications, with admin‑gated service creation and user‑restricted profile access.",
  "feature_evidence.json": "Lists feature evidence entries linking frontend files to Internet Identity–based sign‑up and profile‑saving features.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all major frontend files, describing structure, styling, hooks, and pages.",
  "frontend/index.css": "Tailwind base configuration defining theme variables for light/dark modes and applying global background and text styles.",
  "frontend/index.html": "Minimal HTML shell that mounts the React app and loads Tidio chat script.",
  "frontend/src/App.tsx": "Sets up the router, routes, and theme provider, wrapping pages in BrandLayout and protecting selected routes with AuthGate.",
  "frontend/src/components/AuthGate.tsx": "Redirects unauthenticated users to login and shows a loading spinner while Internet Identity initializes.",
  "frontend/src/components/BrandFooter.tsx": "Renders a branded footer with navigation links, contact info, copyright, and a caffeine.ai attribution link.",
  "frontend/src/components/BrandHeader.tsx": "Header component with navigation, mobile menu, and Internet Identity login/logout handling.",
  "frontend/src/components/BrandLayout.tsx": "Layout wrapper providing header, footer, and main content structure.",
  "frontend/src/components/OtpDemoField.tsx": "Demo OTP generator and verifier with input slots and validation UI.",
  "frontend/src/components/ProductAddToCartSection.tsx": "Product order section handling sample selection, form fields, auth gating, and add‑to‑cart mutation.",
  "frontend/src/components/ProductOrderFormFields.tsx": "Form fields for brand name and description with word counting.",
  "frontend/src/components/ProductSampleSelector.tsx": "Grid selector for sample product images with highlighting of the selected option.",
  "frontend/src/components/ServiceCard.tsx": "Simple service card displaying icon, name, pricing, delivery time, and optional action.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actor instances using identity changes and invalidates dependent queries.",
  "frontend/src/hooks/useAddToCart.ts": "Provides add‑to‑cart mutation and a query for fetching caller orders via the actor.",
  "frontend/src/hooks/useAuthState.ts": "Derives authentication state and principal info from Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity login, stored identities, and status flags.",
  "frontend/src/hooks/useOrderPayment.ts": "Mutation hook to update order payment status and refresh related queries.",
  "frontend/src/hooks/useServices.ts": "Fetches a list of services using react-query, enabled once the actor is ready.",
  "frontend/src/hooks/useSupport.ts": "Provides mutations for submitting support requests and a query for fetching support requests with authorization handling.",
  "frontend/src/hooks/useUserProfile.ts": "Handles fetching and saving the caller's user profile via react-query with mutations for both full and basic profiles.",
  "frontend/src/index.css": "Defines Tailwind base layers and custom black‑and‑gold theme variables plus utility and component styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/BusinessCardPage.tsx": "Displays a product page for Business Cards with details, banner, and add‑to‑cart section.",
  "frontend/src/pages/ContactPage.tsx": "Renders a styled contact page with email and WhatsApp links and hover effects.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard combining services, support requests, profile data, and order handling with form logic and navigation.",
  "frontend/src/pages/HomePage.tsx": "Home page with hero section, service listings, and navigation to product pages or dashboard based on authentication.",
  "frontend/src/pages/LoginPage.tsx": "Login screen using Internet Identity with error handling and redirect on successful authentication.",
  "frontend/src/pages/LogoDesignPage.tsx": "Displays the Logo Design product page with a banner, product description, and an add‑to‑cart section.",
  "frontend/src/pages/PaymentPage.tsx": "Shows order details and a mock payment flow, handling loading, missing orders, and navigation to the success page.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Updates an order’s payment status to completed and displays a confirmation summary after payment.",
  "frontend/src/pages/PhotoFramePage.tsx": "Renders the Photo Frame product page with visuals, product info, and an add‑to‑cart section.",
  "frontend/src/pages/PricingPage.tsx": "Fetches and displays service pricing cards and shows available payment options like Stripe and PayPal.",
  "frontend/src/pages/ProductBannerPage.tsx": "Shows the Product Banner page with imagery, description, and an add‑to‑cart module.",
  "frontend/src/pages/ServicesPage.tsx": "Lists available services with icons and lets users navigate to order, redirecting unauthenticated users to login.",
  "frontend/src/pages/SignUpPage.tsx": "React page handling Internet Identity login and a follow-up profile form to save full name and email before navigating to the dashboard.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them via sessionStorage, and cleaning them from hash-based routes.",
  "frontend/src/utils/validation.ts": "Provides word-count–based description validation with a 1000-word limit and a helper to count words.",
  "frontend/tailwind.config.js": "Tailwind configuration defining custom colors, fonts, animations, and plugins for the frontend design system.",
  "project_state.json": "Metadata describing project state, features, and requirements for implementing an Internet Identity–based signup flow with profile storage."
}