{
  "backend/main.mo": "Motoko canister defining types and CRUD logic for services, user profiles, support requests, orders, and notifications with admin-gated mutations.",
  "feature_evidence.json": "Feature evidence report listing two HomePage.tsx modifications related to premium-services-old section ID and smooth scrolling behavior.",
  "frontend-file-summaries.txt": "Reference file mapping frontend paths to short summaries of their functionality and styling.",
  "frontend/index.css": "Tailwind base theme variables and dark-mode tokens plus global background and border styling.",
  "frontend/index.html": "App entry HTML that mounts the React app and loads Tidio script.",
  "frontend/src/App.tsx": "Router setup defining all application routes wrapped in ThemeProvider and BrandLayout, with AuthGate-protected pages.",
  "frontend/src/components/AuthGate.tsx": "Component that blocks access to protected routes by redirecting unauthenticated users to login while showing a loading state.",
  "frontend/src/components/BrandFooter.tsx": "Footer component with brand info, navigation links, contact details, and caffeine.ai attribution.",
  "frontend/src/components/BrandHeader.tsx": "Header with navigation, auth actions, and mobile menu using Internet Identity login and logout.",
  "frontend/src/components/BrandLayout.tsx": "Page layout wrapper providing header, footer, and main content area.",
  "frontend/src/components/OtpDemoField.tsx": "Demo OTP generator and verifier allowing users to enter and validate a 6‑digit code.",
  "frontend/src/components/ProductAddToCartSection.tsx": "Product order component handling sample selection, form fields, auth checks, and add‑to‑cart mutation.",
  "frontend/src/components/ProductOrderFormFields.tsx": "Form fields for brand name and detailed description with word counting.",
  "frontend/src/components/ProductSampleSelector.tsx": "Grid selector for product sample images with visual selection highlighting.",
  "frontend/src/components/ServiceCard.tsx": "Simple service display card with icon, name, price range, delivery time, and optional action.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actor based on Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAddToCart.ts": "Provides add‑to‑cart mutation and hook for fetching caller orders via backend actor.",
  "frontend/src/hooks/useAuthState.ts": "Returns authentication status and principal based on Internet Identity state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity client, login flow, and stored identity.",
  "frontend/src/hooks/useOrderPayment.ts": "Mutation hook to update order payment status and refresh caller orders.",
  "frontend/src/hooks/useServices.ts": "React Query hook that fetches available services from the actor when ready.",
  "frontend/src/hooks/useSupport.ts": "Provides mutations for submitting support requests and a query for retrieving them, refreshing cache on updates.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks to fetch and save the caller’s user profile using React Query with actor-based API access.",
  "frontend/src/index.css": "Tailwind layers and custom theme variables for light/dark modes plus utility and service card styling.",
  "frontend/src/main.tsx": "App bootstrap rendering with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/BusinessCardPage.tsx": "Product page showing business card details, banner, and add‑to‑cart section.",
  "frontend/src/pages/ContactPage.tsx": "Contact page with email and WhatsApp links styled as interactive cards.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard displaying services, support requests, user profile, and order workflows with form handling.",
  "frontend/src/pages/HomePage.tsx": "Homepage with hero section, service listings, and navigation logic for ordering products.",
  "frontend/src/pages/LoginPage.tsx": "Login page handling Internet Identity authentication and redirecting on success.",
  "frontend/src/pages/LogoDesignPage.tsx": "Product page presenting logo design details, banner, and add‑to‑cart section.",
  "frontend/src/pages/PaymentPage.tsx": "Displays order details, handles loading and missing order states, and navigates to a payment success page after a placeholder payment action.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Updates an order’s payment status to completed and shows a confirmation or error state depending on the update result.",
  "frontend/src/pages/PhotoFramePage.tsx": "Shows a product page for photo frames with description, banner image, and an add‑to‑cart section.",
  "frontend/src/pages/PricingPage.tsx": "Loads and displays service pricing cards and shows accepted payment methods like Stripe and PayPal.",
  "frontend/src/pages/ProductBannerPage.tsx": "Renders a product banner showcase page with description, preview image, and add‑to‑cart options.",
  "frontend/src/pages/ServicesPage.tsx": "Lists available services and routes users to login or dashboard when ordering depending on authentication.",
  "frontend/src/pages/SignUpPage.tsx": "Handles Internet Identity login, multi‑step signup, form validation, OTP check, and profile creation before navigating to the dashboard.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash‑based), persist them in sessionStorage, and clear them from the URL.",
  "frontend/src/utils/validation.ts": "Implements word‑count‑based description validation with a 1000‑word limit and exposes a word‑count helper.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, container settings, and plugins for a premium UI theme.",
  "project_state.json": "Defines the project’s current architecture, features, known issues, and design/tech requirements for the Elvra Worldwide site."
}