{
  "backend/main.mo": "Defines the main actor with all core types for services, orders, payments, user profiles, showcase samples, and migrations, applying Migration.run via with-clause.",
  "backend/migration.mo": "Contains migration logic converting old 4-slot sample structures into new 12-slot showcase arrays for all categories, transforming stored bannerSamples.",
  "feature_evidence.json": "Feature evidence report listing frontend files, components, and test IDs tied to sample gallery and admin upload features.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purpose and contents of all major frontend files.",
  "frontend/index.css": "Tailwind-based global CSS defining OKLCH color variables, dark mode tokens, and shared base styles.",
  "frontend/index.html": "Basic HTML entry point mounting the React root and loading the Tidio script.",
  "frontend/public/deploy-marker.txt": "Deployment marker documenting replacement of product banner fallback images and their source mappings.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, providers, layout, and guarded pages for orders, products, payments, and authentication.",
  "frontend/src/components/admin/ExploreWorkSamplesAdminPanel.tsx": "Admin UI for uploading and updating showcase sample images per category with validation, previews, and upload progress.",
  "frontend/src/components/admin/ProductBannerSamplesAdminPanel.tsx": "File is empty or not provided.",
  "frontend/src/components/AdminGate.tsx": "Component that checks admin status and conditionally renders children or fallback content.",
  "frontend/src/components/AuthGate.tsx": "Route guard that redirects unauthenticated users to /login and shows a loading state while identity initializes.",
  "frontend/src/components/BrandFooter.tsx": "Renders the site footer with brand info, navigation links, contact details, and a dynamic attribution link.",
  "frontend/src/components/BrandHeader.tsx": "Displays the site header with navigation, authentication actions, mobile menu handling, and scroll-to-services behavior.",
  "frontend/src/components/BrandLayout.tsx": "Defines the main page layout combining header, footer, and page content.",
  "frontend/src/components/ExploreWorkSamplesGallery.tsx": "Shows a grid of showcase sample slots for a category, with images or placeholders.",
  "frontend/src/components/OtpDemoField.tsx": "Implements a demo six‑digit OTP generator and verifier with input slots and validation feedback.",
  "frontend/src/components/ProductAddToCartSection.tsx": "Manages a two‑step flow for selecting a sample and submitting order details, including validation and cart submission.",
  "frontend/src/components/ProductOrderFormFields.tsx": "Provides form fields for brand name and description with live word count tracking.",
  "frontend/src/components/ProductSampleSelector.tsx": "Displays selectable product sample images and highlights the chosen option.",
  "frontend/src/components/ServiceCard.tsx": "Presents a simple service card with optional icon, pricing, delivery time, and action content.",
  "frontend/src/constants/premiumServices.ts": "Defines fixed-priced premium service metadata and helpers to retrieve service display info.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries on identity changes.",
  "frontend/src/hooks/useAddToCart.ts": "Hook to add items to cart and fetch caller orders with react-query.",
  "frontend/src/hooks/useAdminOrderVerification.ts": "Provides admin checks, payment verification, and queries for orders and notification requests.",
  "frontend/src/hooks/useAuthState.ts": "Exposes authentication state derived from Internet Identity.",
  "frontend/src/hooks/useCancelOrder.ts": "Mutation hook for canceling an order and refreshing caller orders.",
  "frontend/src/hooks/useConfirmationEmailRequest.ts": "Mutation for submitting confirmation email requests and invalidating related queries.",
  "frontend/src/hooks/useConfirmationMessageTemplate.ts": "Fetches the backend confirmation message template using react-query.",
  "frontend/src/hooks/useCreateCheckoutSession.ts": "Creates a Stripe checkout session via backend actor and returns session URL.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, login/logout, and identity persistence.",
  "frontend/src/hooks/useOrderPayment.ts": "Mutation hook to update order payment status and refresh caller orders.",
  "frontend/src/hooks/useProductBannerSamples.ts": "Fetches and updates product banner showcase samples and defines sample slot metadata.",
  "frontend/src/hooks/useServices.ts": "Fetches available backend services using the actor interface.",
  "frontend/src/hooks/useShowcaseSamples.ts": "Hooks fetch and update showcase samples per category and generate 12 display slots with sample image URLs.",
  "frontend/src/hooks/useStripeConfiguration.ts": "Hooks check whether Stripe is configured and allow updating the Stripe configuration with query invalidation.",
  "frontend/src/hooks/useStripeVerification.ts": "Provides mutations to verify payments, confirm orders, and fetch Stripe session status.",
  "frontend/src/hooks/useSupport.ts": "Hooks submit support requests and fetch support request lists with safe handling for unauthorized access.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks fetch and save the caller’s user profile and basic profile, with query invalidation on updates.",
  "frontend/src/index.css": "Tailwind-based global styles defining a gold‑and‑black theme, utility classes, and service card styling.",
  "frontend/src/main.tsx": "Sets up the React app root with React Query and Internet Identity providers.",
  "frontend/src/pages/BusinessCardPage.tsx": "Page displays business card service details, ordering logic, and a gallery of business card showcases.",
  "frontend/src/pages/ContactPage.tsx": "Simple contact page with styled email and WhatsApp links for inquiries.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard aggregates services, orders, support requests, admin tools, and form handling for order creation.",
  "frontend/src/pages/HelpPage.tsx": "Help and support page with a contact form, validation, and support request submission plus quick links to order cancellation.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, product listings, premium service scrolling, and logic to start an order or redirect to login.",
  "frontend/src/pages/LoginPage.tsx": "Login page using Internet Identity with redirect on successful authentication and basic error handling.",
  "frontend/src/pages/LogoDesignPage.tsx": "Product page for logo design showing details, banner, sample gallery, and order initiation that stores session parameters.",
  "frontend/src/pages/MyOrdersPage.tsx": "Displays user's orders with status icons, payment badges, cancellation logic, and navigation to order details.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Order confirmation page gated by payment completion, showing order details, next steps, and fallback access-denied state.",
  "frontend/src/pages/OrderFormPage.tsx": "Loads order details from session, validates user input, and submits an order to create a cart entry before navigating to payment.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment cancellation message and lets users retry payment or return to their orders.",
  "frontend/src/pages/PaymentPage.tsx": "Displays order details, checks Stripe configuration, and initiates a checkout session to start payment.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Verifies Stripe payment status, confirms the order, and redirects to the order confirmation page.",
  "frontend/src/pages/PhotoFramePage.tsx": "Shows the Photo Frame Design service details and allows authenticated users to start an order.",
  "frontend/src/pages/PricingPage.tsx": "Displays all premium service pricing and available payment options.",
  "frontend/src/pages/ProductBannerPage.tsx": "Renders the Product Banner Design page with service details, preview image, and order handling based on authentication.",
  "frontend/src/pages/ServicesPage.tsx": "Displays a grid of premium service cards and routes users to ordering or login based on authentication.",
  "frontend/src/pages/SignUpPage.tsx": "Handles Internet Identity signup flow, profile creation, and validation before redirecting users.",
  "frontend/src/pages/TrackOrderPage.tsx": "Fetches and displays a specific order’s status, payment details, and navigation options for authenticated users.",
  "frontend/src/utils/stripeOrderMapping.ts": "Converts an ExpandedOrder into an array of ShoppingItem objects with validated pricing.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, persisting, and clearing URL and session parameters.",
  "frontend/src/utils/validation.ts": "Implements word-count and email validation utilities with limits and error messaging.",
  "frontend/tailwind.config.js": "Defines Tailwind CSS configuration with custom colors, typography, animations, and layout settings.",
  "project_state.json": "Defines project state for restoring 12-sample galleries per category with admin-only upload controls, notes missing samples, and lists existing and new feature requests. Includes schema versioning, known issues, and requirements for backend and migration support."
}