{
  "backend/main.mo": "Defines data types for services, users, orders, payments, samples, and state maps for storing them within the backend actor.",
  "feature_evidence.json": "Feature evidence report describing two features: replacing fallback product banner images and rebuilding the app, including impacted components and test IDs.",
  "frontend-file-summaries.txt": "Collection of short summaries for multiple frontend files describing their purpose, styles, hooks, components, and page structures.",
  "frontend/index.css": "Base Tailwind setup defining extensive OKLCH color variables, dark mode overrides, and global element styles.",
  "frontend/index.html": "Basic HTML shell loading main React entrypoint and Tidio script with root mount element.",
  "frontend/public/deploy-marker.txt": "Deployment marker noting replacement of four product banner fallback images with new uploads and readiness for build.",
  "frontend/src/App.tsx": "Sets up the full TanStack Router configuration, global providers, and all product, payment, and dashboard routes.",
  "frontend/src/components/admin/ProductBannerSamplesAdminPanel.tsx": "Admin panel to upload and manage product banner sample images with progress tracking.",
  "frontend/src/components/AdminGate.tsx": "Wrapper that renders children only for admin callers using an admin-check hook, with optional fallback.",
  "frontend/src/components/AuthGate.tsx": "Auth guard that redirects unauthenticated users to login and shows a loading spinner during identity initialization.",
  "frontend/src/components/BrandFooter.tsx": "Footer component with branding, quick links, contact info, and Caffeine.ai attribution using dynamic year and hostname.",
  "frontend/src/components/BrandHeader.tsx": "Header component with navigation, authentication actions, mobile menu, and service scrolling logic.",
  "frontend/src/components/BrandLayout.tsx": "Wraps pages with a header, footer, and main content layout.",
  "frontend/src/components/OtpDemoField.tsx": "Generates a demo OTP and verifies user input using a 6‑digit OTP UI component.",
  "frontend/src/components/ProductAddToCartSection.tsx": "Handles sample selection, form validation, and submitting product orders to the cart.",
  "frontend/src/components/ProductOrderFormFields.tsx": "Provides form fields for brand name and description with live word counting.",
  "frontend/src/components/ProductSampleSelector.tsx": "Displays sample design thumbnails and lets users choose one.",
  "frontend/src/components/ServiceCard.tsx": "Renders a simple service card with icon, name, price, delivery time, and optional action.",
  "frontend/src/constants/premiumServices.ts": "Defines fixed premium service metadata and helpers to retrieve display info.",
  "frontend/src/hooks/useActor.ts": "Creates and manages authenticated or anonymous backend actors, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useAddToCart.ts": "Provides mutations to add items to cart and a query to fetch caller orders using react-query and an actor.",
  "frontend/src/hooks/useAdminOrderVerification.ts": "Hooks for checking admin status, verifying payments, and fetching orders or notification requests via actor queries and mutations.",
  "frontend/src/hooks/useAuthState.ts": "Derives authentication state and principal string from Internet Identity.",
  "frontend/src/hooks/useConfirmationEmailRequest.ts": "Mutation hook to submit confirmation email requests and invalidate related queries.",
  "frontend/src/hooks/useConfirmationMessageTemplate.ts": "Fetches the confirmation message template from the backend actor.",
  "frontend/src/hooks/useCreateCheckoutSession.ts": "Creates a Stripe checkout session via actor call and parses the returned JSON session data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, auth client setup, login/logout logic, and status handling.",
  "frontend/src/hooks/useOrderPayment.ts": "Mutation hook to update order payment status and refresh caller orders.",
  "frontend/src/hooks/useProductBannerSamples.ts": "Hooks to fetch and update product banner samples and map them into predefined sample slots.",
  "frontend/src/hooks/useServices.ts": "Fetches available services from the backend actor.",
  "frontend/src/hooks/useStripeConfiguration.ts": "Hooks to check and set Stripe configuration, invalidating related queries on update.",
  "frontend/src/hooks/useStripeVerification.ts": "Hooks for verifying Stripe payments and checking session status via actor mutations.",
  "frontend/src/hooks/useSupport.ts": "Handles submitting support requests and fetching them with authorization fallback.",
  "frontend/src/hooks/useUserProfile.ts": "Fetches and saves user profiles, exposing loading state and invalidating profile queries on updates.",
  "frontend/src/index.css": "Defines global Tailwind-based premium black-and-gold theme styles and service card UI styling.",
  "frontend/src/main.tsx": "Bootstraps the app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/BusinessCardPage.tsx": "Renders a product page for Business Card Design with details, banner image, contact link, and add‑to‑cart section.",
  "frontend/src/pages/ContactPage.tsx": "Shows a styled contact page with email and WhatsApp links and simple hover effects.",
  "frontend/src/pages/DashboardPage.tsx": "Displays user dashboard with service selection, form handling, admin tools, and add‑to‑cart logic.",
  "frontend/src/pages/HomePage.tsx": "Home page with hero section, premium services section, scrolling behavior, and navigation to ordering or dashboard.",
  "frontend/src/pages/LoginPage.tsx": "Provides Internet Identity login flow with error handling and redirect on success.",
  "frontend/src/pages/LogoDesignPage.tsx": "Renders a product page for Logo Design with details, banner image, contact link, and add‑to‑cart section.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Confirms completed orders, checks payment authorization, and displays success or access‑denied states.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment cancellation message, retrieves the pending orderId from sessionStorage, and offers retry or dashboard navigation.",
  "frontend/src/pages/PaymentPage.tsx": "Loads an order, checks Stripe readiness, and initiates a checkout session while handling errors and redirecting to Stripe.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Verifies a completed Stripe session, confirms the order, handles errors, and redirects to the order confirmation page.",
  "frontend/src/pages/PhotoFramePage.tsx": "Shows details for the Photo Frame Design service with imagery and a section to add the product to the cart.",
  "frontend/src/pages/PricingPage.tsx": "Displays premium service pricing cards and lists accepted payment options including Stripe and PayPal.",
  "frontend/src/pages/ProductBannerPage.tsx": "Provides preview toggles for Product Banner designs and includes an add‑to‑cart section.",
  "frontend/src/pages/ServicesPage.tsx": "Lists all premium services and routes users to login or dashboard when ordering based on authentication status.",
  "frontend/src/pages/SignUpPage.tsx": "Sign-up page that handles Internet Identity login, checks for an existing profile, and submits a basic profile form. Manages auth flow, validation, and redirects to the dashboard.",
  "frontend/src/pages/TrackOrderPage.tsx": "Order-tracking page that loads the caller’s orders, finds the requested order, and displays status details or an error if not found. Includes status icons, descriptions, and navigation controls.",
  "frontend/src/utils/stripeOrderMapping.ts": "Maps an ExpandedOrder into a Stripe ShoppingItem array by parsing price and constructing a single-item purchase. Ensures valid price format and uses BigInt for price and quantity.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read URL parameters, persist them in sessionStorage, and clear them from the URL hash. Supports both query-string and hash-based routing.",
  "frontend/src/utils/validation.ts": "Provides word-count and description validation plus a basic email format validator. Enforces a 1000-word limit for descriptions.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, themes, animations, and plugins like typography and container queries. Defines global styling tokens and layout settings.",
  "project_state.json": "Project state describing goals to replace Product Banner sample images and rebuild/deploy the app, with notes on deployment issues and feature request tracking."
}